hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * MMCRXIPIS (RO)
 *
 * MMC Receive Checksum Offload Interrupt Status
 * This bit is set high when an interrupt is generated in the MMC Receive Checksum Offload Interrupt Register. This bit is cleared when all the bits in this interrupt register are cleared.
 */
#define ENET_INTR_STATUS_MMCRXIPIS_MASK (0x80U)
#define ENET_INTR_STATUS_MMCRXIPIS_SHIFT (7U)
#define ENET_INTR_STATUS_MMCRXIPIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_MMCRXIPIS_MASK) >> ENET_INTR_STATUS_MMCRXIPIS_SHIFT)

/*
 * MMCTXIS (RO)
 *
 * MMC Transmit Interrupt Status
 * This bit is set high when an interrupt is generated in the MMC Transmit Interrupt Register. This bit is cleared when all the bits in this interrupt register are cleared.
 */
#define ENET_INTR_STATUS_MMCTXIS_MASK (0x40U)
#define ENET_INTR_STATUS_MMCTXIS_SHIFT (6U)
#define ENET_INTR_STATUS_MMCTXIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_MMCTXIS_MASK) >> ENET_INTR_STATUS_MMCTXIS_SHIFT)

/*
 * MMCRXIS (RO)
 *
 * MMC Receive Interrupt Status
 * This bit is set high when an interrupt is generated in the MMC Receive Interrupt Register. This bit is cleared when all the bits in this interrupt register are cleared.
 */
#define ENET_INTR_STATUS_MMCRXIS_MASK (0x20U)
#define ENET_INTR_STATUS_MMCRXIS_SHIFT (5U)
#define ENET_INTR_STATUS_MMCRXIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_MMCRXIS_MASK) >> ENET_INTR_STATUS_MMCRXIS_SHIFT)

/*
 * MMCIS (RO)
 *
 * MMC Interrupt Status
 * This bit is set high when any of the Bits [7:5] is set high and cleared only when all of these bits are low.
 */
#define ENET_INTR_STATUS_MMCIS_MASK (0x10U)
#define ENET_INTR_STATUS_MMCIS_SHIFT (4U)
#define ENET_INTR_STATUS_MMCIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_MMCIS_MASK) >> ENET_INTR_STATUS_MMCIS_SHIFT)

/*
 * PMTIS (RO)
 *
 * PMT Interrupt Status
 * This bit is set when a magic packet or remote wake-up frame is received in the power-down mode (see Bits 5 and 6 in the PMT Control and Status Register). This bit is cleared when both Bits[6:5] are cleared because of a read operation to the PMT Control and Status register.
 */
#define ENET_INTR_STATUS_PMTIS_MASK (0x8U)
#define ENET_INTR_STATUS_PMTIS_SHIFT (3U)
#define ENET_INTR_STATUS_PMTIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_PMTIS_MASK) >> ENET_INTR_STATUS_PMTIS_SHIFT)

/*
 * PCSANCIS (RO)
 *
 * PCS Auto-Negotiation Complete
 * This bit is set when the Auto-negotiation is completed in the TBI, RTBI, or SGMII PHY interface (Bit 5 in Register 49 (AN Status Register)). This bit is cleared when you perform a read operation to the AN Status register.
 */
#define ENET_INTR_STATUS_PCSANCIS_MASK (0x4U)
#define ENET_INTR_STATUS_PCSANCIS_SHIFT (2U)
#define ENET_INTR_STATUS_PCSANCIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_PCSANCIS_MASK) >> ENET_INTR_STATUS_PCSANCIS_SHIFT)

/*
 * PCSLCHGIS (RO)
 *
 * PCS Link Status Changed
 * This bit is set because of any change in Link Status in the TBI, RTBI, or SGMII PHY interface (Bit 2 in Register 49 (AN Status Register)). This bit is cleared when you perform a read operation on the AN Status register.
 */
#define ENET_INTR_STATUS_PCSLCHGIS_MASK (0x2U)
#define ENET_INTR_STATUS_PCSLCHGIS_SHIFT (1U)
#define ENET_INTR_STATUS_PCSLCHGIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_PCSLCHGIS_MASK) >> ENET_INTR_STATUS_PCSLCHGIS_SHIFT)

/*
 * RGSMIIIS (RO)
 *
 * RGMII or SMII Interrupt Status
 * This bit is set because of any change in value of the Link Status of RGMII or SMII interface (Bit 3 in Register 54 (SGMII/RGMII/SMII Control and Status Register)). This bit is cleared when you perform a read operation on the SGMII/RGMII/SMII Control and Status Register.
 */
#define ENET_INTR_STATUS_RGSMIIIS_MASK (0x1U)
#define ENET_INTR_STATUS_RGSMIIIS_SHIFT (0U)
#define ENET_INTR_STATUS_RGSMIIIS_GET(x) (((uint32_t)(x) & ENET_INTR_STATUS_RGSMIIIS_MASK) >> ENET_INTR_STATUS_RGSMIIIS_SHIFT)

/* Bitfield definition for register: INTR_MASK */
/*
 * LPIIM (RW)
 *
 * LPI Interrupt Mask
 * When set, this bit disables the assertion of the interrupt signal because of the setting of the LPI Interrupt Status bit in Register 14 (Interrupt Status Register).
 */
#define ENET_INTR_MASK_LPIIM_MASK (0x400U)
#define ENET_INTR_MASK_LPIIM_SHIFT (10U)
#define ENET_INTR_MASK_LPIIM_SET(x) (((uint32_t)(x) << ENET_INTR_MASK_LPIIM_SHIFT) & ENET_INTR_MASK_LPIIM_MASK)
#define ENET_INTR_MASK_LPIIM_GET(x) (((uint32_t)(x) & ENET_INTR_MASK_LPIIM_MASK) >> ENET_INTR_MASK_LPIIM_SHIFT)

/*
 * TSIM (RW)
 *
 * Timestamp Interrupt Mask
 *  When set, this bit disables the assertion of the interrupt signal because of the setting of Timestamp Interrupt Status bit in Register 14 (Interrupt Status Register).
 */
#define ENET_INTR_MASK_TSIM_MASK (0x200U)
#define ENET_INTR_MASK_TSIM_SHIFT (9U)
#define ENET_INTR_MASK_TSIM_SET(x) (((uint32_t)(x) << ENET_INTR_MASK_TSIM_SHIFT) & ENET_INTR_MASK_TSIM_MASK)
#define ENET_INTR_MASK_TSIM_GET(x) (((uint32_t)(x) & ENET_INTR_MASK_TSIM_MASK) >> ENET_INTR_MASK_TSIM_SHIFT)

/*
 * PMTIM (RW)
 *
 * PMT Interrupt Mask
 *  When set, this bit disables the assertion of the interrupt signal because of the setting of PMT Interrupt Status bit in Register 14 (Interrupt Status Register).
 */
#define ENET_INTR_MASK_PMTIM_MASK (0x8U)
#define ENET_INTR_MASK_PMTIM_SHIFT (3U)
#define ENET_INTR_MASK_PMTIM_SET(x) (((uint32_t)(x) << ENET_INTR_MASK_PMTIM_SHIFT) & ENET_INTR_MASK_PMTIM_MASK)
#define ENET_INTR_MASK_PMTIM_GET(x) (((uint32_t)(x) & ENET_INTR_MASK_PMTIM_MASK) >> ENET_INTR_MASK_PMTIM_SHIFT)

/*
 * PCSANCIM (RW)
 *
 * PCS AN Completion Interrupt Mask
 * When set, this bit disables the assertion of the interrupt signal because of the setting of PCS Auto-negotiation complete bit in Register 14 (Interrupt Status Register).
 */
#define ENET_INTR_MASK_PCSANCIM_MASK (0x4U)
#define ENET_INTR_MASK_PCSANCIM_SHIFT (2U)
#define ENET_INTR_MASK_PCSANCIM_SET(x) (((uint32_t)(x) << ENET_INTR_MASK_PCSANCIM_SHIFT) & ENET_INTR_MASK_PCSANCIM_MASK)
#define ENET_INTR_MASK_PCSANCIM_GET(x) (((uint32_t)(x) & ENET_INTR_MASK_PCSANCIM_MASK) >> ENET_INTR_MASK_PCSANCIM_SHIFT)

