hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/* Bitfield definition for register: XMII_CSR */
/*
 * FALSCARDET (RW)
 *
 * False Carrier Detected
 *  This bit indicates whether the SMII PHY detected false carrier (1'b1). This bit is reserved when the MAC is configured for the SGMII or RGMII PHY interface.
 */
#define ENET_XMII_CSR_FALSCARDET_MASK (0x20U)
#define ENET_XMII_CSR_FALSCARDET_SHIFT (5U)
#define ENET_XMII_CSR_FALSCARDET_SET(x) (((uint32_t)(x) << ENET_XMII_CSR_FALSCARDET_SHIFT) & ENET_XMII_CSR_FALSCARDET_MASK)
#define ENET_XMII_CSR_FALSCARDET_GET(x) (((uint32_t)(x) & ENET_XMII_CSR_FALSCARDET_MASK) >> ENET_XMII_CSR_FALSCARDET_SHIFT)

/*
 * JABTO (RW)
 *
 * Jabber Timeout
 *  This bit indicates whether there is jabber timeout error (1'b1) in the received frame. This bit is reserved when the MAC is configured for the SGMII or RGMII PHY interface.
 */
#define ENET_XMII_CSR_JABTO_MASK (0x10U)
#define ENET_XMII_CSR_JABTO_SHIFT (4U)
#define ENET_XMII_CSR_JABTO_SET(x) (((uint32_t)(x) << ENET_XMII_CSR_JABTO_SHIFT) & ENET_XMII_CSR_JABTO_MASK)
#define ENET_XMII_CSR_JABTO_GET(x) (((uint32_t)(x) & ENET_XMII_CSR_JABTO_MASK) >> ENET_XMII_CSR_JABTO_SHIFT)

/*
 * LNKSTS (RW)
 *
 * Link Status
 *  This bit indicates whether the link between the local PHY and the remote PHY is up or down. It gives the status of the link between the SGMII of MAC and the SGMII of the local PHY. The status bits are received from the local PHY during ANEG betweent he MAC and PHY on the SGMII link.
 */
#define ENET_XMII_CSR_LNKSTS_MASK (0x8U)
#define ENET_XMII_CSR_LNKSTS_SHIFT (3U)
#define ENET_XMII_CSR_LNKSTS_SET(x) (((uint32_t)(x) << ENET_XMII_CSR_LNKSTS_SHIFT) & ENET_XMII_CSR_LNKSTS_MASK)
#define ENET_XMII_CSR_LNKSTS_GET(x) (((uint32_t)(x) & ENET_XMII_CSR_LNKSTS_MASK) >> ENET_XMII_CSR_LNKSTS_SHIFT)

/*
 * LNKSPEED (RW)
 *
 * Link Speed
 *  This bit indicates the current speed of the link:
 * - 00: 2.5 MHz
 * - 01: 25 MHz
 * - 10: 125 MHz Bit 2 is reserved when the MAC is configured for the SMII PHY interface.
 */
#define ENET_XMII_CSR_LNKSPEED_MASK (0x6U)
#define ENET_XMII_CSR_LNKSPEED_SHIFT (1U)
#define ENET_XMII_CSR_LNKSPEED_SET(x) (((uint32_t)(x) << ENET_XMII_CSR_LNKSPEED_SHIFT) & ENET_XMII_CSR_LNKSPEED_MASK)
#define ENET_XMII_CSR_LNKSPEED_GET(x) (((uint32_t)(x) & ENET_XMII_CSR_LNKSPEED_MASK) >> ENET_XMII_CSR_LNKSPEED_SHIFT)

/*
 * LNKMOD (RW)
 *
 * Link Mode
 *  This bit indicates the current mode of operation of the link:
 * - 1’b0: Half-duplex mode
 * - 1’b1: Full-duplex mode
 */
#define ENET_XMII_CSR_LNKMOD_MASK (0x1U)
#define ENET_XMII_CSR_LNKMOD_SHIFT (0U)
#define ENET_XMII_CSR_LNKMOD_SET(x) (((uint32_t)(x) << ENET_XMII_CSR_LNKMOD_SHIFT) & ENET_XMII_CSR_LNKMOD_MASK)
#define ENET_XMII_CSR_LNKMOD_GET(x) (((uint32_t)(x) & ENET_XMII_CSR_LNKMOD_MASK) >> ENET_XMII_CSR_LNKMOD_SHIFT)

/* Bitfield definition for register: WDOG_WTO */
/*
 * PWE (RW)
 *
 * Programmable Watchdog Enable
 *  When this bit is set and Bit 23 (WD) of Register 0 (MAC Configuration Register) is reset, the WTO field (Bits[13:0]) is used as watchdog timeout for a received frame. When this bit is cleared, the watchdog timeout for a received frame is controlled by the setting of Bit 23 (WD) and Bit 20 (JE) in Register 0 (MAC Configuration Register).
 */
#define ENET_WDOG_WTO_PWE_MASK (0x10000UL)
#define ENET_WDOG_WTO_PWE_SHIFT (16U)
#define ENET_WDOG_WTO_PWE_SET(x) (((uint32_t)(x) << ENET_WDOG_WTO_PWE_SHIFT) & ENET_WDOG_WTO_PWE_MASK)
#define ENET_WDOG_WTO_PWE_GET(x) (((uint32_t)(x) & ENET_WDOG_WTO_PWE_MASK) >> ENET_WDOG_WTO_PWE_SHIFT)

/*
 * WTO (RW)
 *
 * Watchdog Timeout
 * When Bit 16 (PWE) is set and Bit 23 (WD) of Register 0 (MAC Configuration Register) is reset, this field is used as watchdog timeout for a received frame. If the length of a received frame exceeds the value of this field, such frame is terminated and declared as an error frame. Note: When Bit 16 (PWE) is set, the value in this field should be more than 1,522 (0x05F2). Otherwise, the IEEE Std 802.3-specified valid tagged frames are declared as error frames and are dropped.
 */
#define ENET_WDOG_WTO_WTO_MASK (0x3FFFU)
#define ENET_WDOG_WTO_WTO_SHIFT (0U)
#define ENET_WDOG_WTO_WTO_SET(x) (((uint32_t)(x) << ENET_WDOG_WTO_WTO_SHIFT) & ENET_WDOG_WTO_WTO_MASK)
#define ENET_WDOG_WTO_WTO_GET(x) (((uint32_t)(x) & ENET_WDOG_WTO_WTO_MASK) >> ENET_WDOG_WTO_WTO_SHIFT)

/* Bitfield definition for register: MMC_CNTRL */
/*
 * UCDBC (RW)
 *
 * Update MMC Counters for Dropped Broadcast Frames
 * When set, the MAC updates all related MMC Counters for Broadcast frames that are dropped because of the setting of Bit 5 (DBF) of Register 1 (MAC Frame Filter). When reset, the MMC Counters are not updated for dropped Broadcast frames.
 */
#define ENET_MMC_CNTRL_UCDBC_MASK (0x100U)
#define ENET_MMC_CNTRL_UCDBC_SHIFT (8U)
#define ENET_MMC_CNTRL_UCDBC_SET(x) (((uint32_t)(x) << ENET_MMC_CNTRL_UCDBC_SHIFT) & ENET_MMC_CNTRL_UCDBC_MASK)
#define ENET_MMC_CNTRL_UCDBC_GET(x) (((uint32_t)(x) & ENET_MMC_CNTRL_UCDBC_MASK) >> ENET_MMC_CNTRL_UCDBC_SHIFT)

/*
 * CNTPRSTLVL (RW)
 *
 * Full-Half Preset
 * When this bit is low and Bit 4 is set, all MMC counters get preset to almost-half value. All octet counters get preset to 0x7FFF_F800 (half
 * - 2KBytes) and all frame-counters gets preset to 0x7FFF_FFF0 (half
 * - 16). When this bit is high and Bit 4 is set, all MMC counters get preset to almost-full value. All octet counters get preset to 0xFFFF_F800 (full
 * - 2KBytes) and all frame-counters gets preset to 0xFFFF_FFF0 (full
 * - 16). For 16-bit counters, the almost-half preset values are 0x7800 and 0x7FF0 for the respective octet and frame counters. Similarly, the almost-full preset values for the 16-bit counters are 0xF800 and 0xFFF0.
 */
#define ENET_MMC_CNTRL_CNTPRSTLVL_MASK (0x20U)
#define ENET_MMC_CNTRL_CNTPRSTLVL_SHIFT (5U)
#define ENET_MMC_CNTRL_CNTPRSTLVL_SET(x) (((uint32_t)(x) << ENET_MMC_CNTRL_CNTPRSTLVL_SHIFT) & ENET_MMC_CNTRL_CNTPRSTLVL_MASK)
#define ENET_MMC_CNTRL_CNTPRSTLVL_GET(x) (((uint32_t)(x) & ENET_MMC_CNTRL_CNTPRSTLVL_MASK) >> ENET_MMC_CNTRL_CNTPRSTLVL_SHIFT)

