hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/* Bitfield definition for register: MMC_IPC_INTR_RX */
/*
 * RXICMPEROIS (RW)
 *
 * MMC Receive ICMP Error Octet Counter Interrupt Status
 * This bit is set when the rxicmp_err_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXICMPEROIS_MASK (0x20000000UL)
#define ENET_MMC_IPC_INTR_RX_RXICMPEROIS_SHIFT (29U)
#define ENET_MMC_IPC_INTR_RX_RXICMPEROIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXICMPEROIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXICMPEROIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXICMPEROIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXICMPEROIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXICMPEROIS_SHIFT)

/*
 * RXICMPGOIS (RW)
 *
 * MMC Receive ICMP Good Octet Counter Interrupt Status
 * This bit is set when the rxicmp_gd_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXICMPGOIS_MASK (0x10000000UL)
#define ENET_MMC_IPC_INTR_RX_RXICMPGOIS_SHIFT (28U)
#define ENET_MMC_IPC_INTR_RX_RXICMPGOIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXICMPGOIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXICMPGOIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXICMPGOIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXICMPGOIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXICMPGOIS_SHIFT)

/*
 * RXTCPEROIS (RW)
 *
 * MMC Receive TCP Error Octet Counter Interrupt Status
 * This bit is set when the rxtcp_err_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXTCPEROIS_MASK (0x8000000UL)
#define ENET_MMC_IPC_INTR_RX_RXTCPEROIS_SHIFT (27U)
#define ENET_MMC_IPC_INTR_RX_RXTCPEROIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXTCPEROIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXTCPEROIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXTCPEROIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXTCPEROIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXTCPEROIS_SHIFT)

/*
 * RXTCPGOIS (RW)
 *
 * MMC Receive TCP Good Octet Counter Interrupt Status
 * This bit is set when the rxtcp_gd_octets counter reaches half of the maximum value or the maximum value
 */
#define ENET_MMC_IPC_INTR_RX_RXTCPGOIS_MASK (0x4000000UL)
#define ENET_MMC_IPC_INTR_RX_RXTCPGOIS_SHIFT (26U)
#define ENET_MMC_IPC_INTR_RX_RXTCPGOIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXTCPGOIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXTCPGOIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXTCPGOIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXTCPGOIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXTCPGOIS_SHIFT)

/*
 * RXUDPEROIS (RW)
 *
 * MMC Receive UDP Error Octet Counter Interrupt Status
 * This bit is set when the rxudp_err_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXUDPEROIS_MASK (0x2000000UL)
#define ENET_MMC_IPC_INTR_RX_RXUDPEROIS_SHIFT (25U)
#define ENET_MMC_IPC_INTR_RX_RXUDPEROIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXUDPEROIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXUDPEROIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXUDPEROIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXUDPEROIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXUDPEROIS_SHIFT)

/*
 * RXUDPGOIS (RW)
 *
 * MMC Receive UDP Good Octet Counter Interrupt Status
 * This bit is set when the rxudp_gd_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXUDPGOIS_MASK (0x1000000UL)
#define ENET_MMC_IPC_INTR_RX_RXUDPGOIS_SHIFT (24U)
#define ENET_MMC_IPC_INTR_RX_RXUDPGOIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXUDPGOIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXUDPGOIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXUDPGOIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXUDPGOIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXUDPGOIS_SHIFT)

/*
 * RXIPV6NOPAYOIS (RW)
 *
 * MMC Receive IPV6 No Payload Octet Counter Interrupt Status
 * This bit is set when the rxipv6_nopay_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYOIS_MASK (0x800000UL)
#define ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYOIS_SHIFT (23U)
#define ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYOIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYOIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYOIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYOIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYOIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYOIS_SHIFT)

/*
 * RXIPV6HEROIS (RW)
 *
 * MMC Receive IPV6 Header Error Octet Counter Interrupt Status
 * This bit is set when the rxipv6_hdrerr_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV6HEROIS_MASK (0x400000UL)
#define ENET_MMC_IPC_INTR_RX_RXIPV6HEROIS_SHIFT (22U)
#define ENET_MMC_IPC_INTR_RX_RXIPV6HEROIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV6HEROIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV6HEROIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV6HEROIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV6HEROIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV6HEROIS_SHIFT)

/*
 * RXIPV6GOIS (RW)
 *
 * MMC Receive IPV6 Good Octet Counter Interrupt Status
 * This bit is set when the rxipv6_gd_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV6GOIS_MASK (0x200000UL)
#define ENET_MMC_IPC_INTR_RX_RXIPV6GOIS_SHIFT (21U)
#define ENET_MMC_IPC_INTR_RX_RXIPV6GOIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV6GOIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV6GOIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV6GOIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV6GOIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV6GOIS_SHIFT)

/*
 * RXIPV4UDSBLOIS (RW)
 *
 * MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Status
 * This bit is set when the rxipv4_udsbl_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV4UDSBLOIS_MASK (0x100000UL)
#define ENET_MMC_IPC_INTR_RX_RXIPV4UDSBLOIS_SHIFT (20U)
#define ENET_MMC_IPC_INTR_RX_RXIPV4UDSBLOIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV4UDSBLOIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV4UDSBLOIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV4UDSBLOIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV4UDSBLOIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV4UDSBLOIS_SHIFT)

