hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_enet_regs.h
/*
 * PPSCMD2 (RW)
 *
 * Flexible PPS2 Output Control
 * This field controls the flexible PPS2 output (ptp_pps_o[2]) signal. This field is similar to PPSCMD0[2:0] in functionality.
 */
#define ENET_PPS_CTRL_PPSCMD2_MASK (0x70000UL)
#define ENET_PPS_CTRL_PPSCMD2_SHIFT (16U)
#define ENET_PPS_CTRL_PPSCMD2_SET(x) (((uint32_t)(x) << ENET_PPS_CTRL_PPSCMD2_SHIFT) & ENET_PPS_CTRL_PPSCMD2_MASK)
#define ENET_PPS_CTRL_PPSCMD2_GET(x) (((uint32_t)(x) & ENET_PPS_CTRL_PPSCMD2_MASK) >> ENET_PPS_CTRL_PPSCMD2_SHIFT)

/*
 * TRGTMODSEL1 (RW)
 *
 * Target Time Register Mode for PPS1 Output
 * This field indicates the Target Time registers (register 480 and 481) mode for PPS1 output signal. This field is similar to the TRGTMODSEL0 field.
 */
#define ENET_PPS_CTRL_TRGTMODSEL1_MASK (0x6000U)
#define ENET_PPS_CTRL_TRGTMODSEL1_SHIFT (13U)
#define ENET_PPS_CTRL_TRGTMODSEL1_SET(x) (((uint32_t)(x) << ENET_PPS_CTRL_TRGTMODSEL1_SHIFT) & ENET_PPS_CTRL_TRGTMODSEL1_MASK)
#define ENET_PPS_CTRL_TRGTMODSEL1_GET(x) (((uint32_t)(x) & ENET_PPS_CTRL_TRGTMODSEL1_MASK) >> ENET_PPS_CTRL_TRGTMODSEL1_SHIFT)

/*
 * PPSEN1 (RW)
 *
 * Flexible PPS1 Output Mode Enable
 * When set high, Bits[10:8] function as PPSCMD.
 */
#define ENET_PPS_CTRL_PPSEN1_MASK (0x1000U)
#define ENET_PPS_CTRL_PPSEN1_SHIFT (12U)
#define ENET_PPS_CTRL_PPSEN1_SET(x) (((uint32_t)(x) << ENET_PPS_CTRL_PPSEN1_SHIFT) & ENET_PPS_CTRL_PPSEN1_MASK)
#define ENET_PPS_CTRL_PPSEN1_GET(x) (((uint32_t)(x) & ENET_PPS_CTRL_PPSEN1_MASK) >> ENET_PPS_CTRL_PPSEN1_SHIFT)

/*
 * PPSCMD1 (RW)
 *
 * Flexible PPS1 Output Control
 * This field controls the flexible PPS1 output (ptp_pps_o[1]) signal. This field is similar to PPSCMD0[2:0] in functionality.
 */
#define ENET_PPS_CTRL_PPSCMD1_MASK (0x700U)
#define ENET_PPS_CTRL_PPSCMD1_SHIFT (8U)
#define ENET_PPS_CTRL_PPSCMD1_SET(x) (((uint32_t)(x) << ENET_PPS_CTRL_PPSCMD1_SHIFT) & ENET_PPS_CTRL_PPSCMD1_MASK)
#define ENET_PPS_CTRL_PPSCMD1_GET(x) (((uint32_t)(x) & ENET_PPS_CTRL_PPSCMD1_MASK) >> ENET_PPS_CTRL_PPSCMD1_SHIFT)

/*
 * TRGTMODSEL0 (RW)
 *
 * Target Time Register Mode for PPS0 Output
 *  This field indicates the Target Time registers (register 455 and 456) mode for PPS0 output signal:
 * - 00: Indicates that the Target Time registers are programmed only for generating the interrupt event.
 * - 01: Reserved
 * - 10: Indicates that the Target Time registers are programmed for generating the interrupt event and starting or stopping the generation of the PPS0 output signal.
 * - 11: Indicates that the Target Time registers are programmed only for starting or stopping the generation of the PPS0 output signal. No interrupt is asserted.
 */
#define ENET_PPS_CTRL_TRGTMODSEL0_MASK (0x60U)
#define ENET_PPS_CTRL_TRGTMODSEL0_SHIFT (5U)
#define ENET_PPS_CTRL_TRGTMODSEL0_SET(x) (((uint32_t)(x) << ENET_PPS_CTRL_TRGTMODSEL0_SHIFT) & ENET_PPS_CTRL_TRGTMODSEL0_MASK)
#define ENET_PPS_CTRL_TRGTMODSEL0_GET(x) (((uint32_t)(x) & ENET_PPS_CTRL_TRGTMODSEL0_MASK) >> ENET_PPS_CTRL_TRGTMODSEL0_SHIFT)

/*
 * PPSEN0 (RW)
 *
 * Flexible PPS Output Mode Enable
 * When set low, Bits [3:0] function as PPSCTRL (backward compatible). When set high, Bits[3:0] function as PPSCMD.
 */
#define ENET_PPS_CTRL_PPSEN0_MASK (0x10U)
#define ENET_PPS_CTRL_PPSEN0_SHIFT (4U)
#define ENET_PPS_CTRL_PPSEN0_SET(x) (((uint32_t)(x) << ENET_PPS_CTRL_PPSEN0_SHIFT) & ENET_PPS_CTRL_PPSEN0_MASK)
#define ENET_PPS_CTRL_PPSEN0_GET(x) (((uint32_t)(x) & ENET_PPS_CTRL_PPSEN0_MASK) >> ENET_PPS_CTRL_PPSEN0_SHIFT)

/*
 * PPSCTRLCMD0 (RW)
 *
 * PPSCTRL0: PPS0 Output Frequency Control
 * This field controls the frequency of the PPS0 output (ptp_pps_o[0]) signal. The default value of PPSCTRL is 0000, and the PPS output is 1 pulse (of width clk_ptp_i) every second. For other values of PPSCTRL, the PPS output becomes a generated clock of following frequencies:
 * - 0001: The binary rollover is 2 Hz, and the digital rollover is 1 Hz.
 * - 0010: The binary rollover is 4 Hz, and the digital rollover is 2 Hz.
 * - 0011: The binary rollover is 8 Hz, and the digital rollover is 4 Hz.
 * - 0100: The binary rollover is 16 Hz, and the digital rollover is 8 Hz. - ...
 * - 1111: The binary rollover is 32.768 KHz, and the digital rollover is 16.384 KHz. Note: In the binary rollover mode, the PPS output (ptp_pps_o) has a duty cycle of 50 percent with these frequencies. In the digital rollover mode, the PPS output frequency is an average number. The actual clock is of different frequency that gets synchronized every second. For example: - When PPSCTRL = 0001, the PPS (1 Hz) has a low period of 537 ms and a high period of 463 ms - When PPSCTRL = 0010, the PPS (2 Hz) is a sequence of: - One clock of 50 percent duty cycle and 537 ms period - Second clock of 463 ms period (268 ms low and 195 ms high) - When PPSCTRL = 0011, the PPS (4 Hz) is a sequence of: - Three clocks of 50 percent duty cycle and 268 ms period - Fourth clock of 195 ms period (134 ms low and 61 ms high)
 * PPSCMD0: Flexible PPS0 Output Control
 * 0000: No Command
 * 0001: START Single Pulse
 * This command generates single pulse rising at the start point defined in
 * Target Time Registers and of a duration defined
 * in the PPS0 Width Register.
 * 0010: START Pulse Train
 * This command generates the train of pulses rising at the start point
 * defined in the Target Time Registers and of a duration defined in the
 * PPS0 Width Register and repeated at interval defined in the PPS
 * Interval Register. By default, the PPS pulse train is free-running unless
 * stopped by ‘STOP Pulse train at time’ or ‘STOP Pulse Train
 * immediately’ commands.
 * 0011: Cancel START
 * This command cancels the START Single Pulse and START Pulse Train
 * commands if the system time has not crossed the programmed start
 * time.
 * 0100: STOP Pulse train at time
 * This command stops the train of pulses initiated by the START Pulse
 * Train command (PPSCMD = 0010) after the time programmed in the
 * Target Time registers elapses.
 * 0101: STOP Pulse Train immediately
 * This command immediately stops the train of pulses initiated by the
 * START Pulse Train command (PPSCMD = 0010).
 * 0110: Cancel STOP Pulse train
 * This command cancels the STOP pulse train at time command if the
 * programmed stop time has not elapsed. The PPS pulse train becomes
 * free-running on the successful execution of this command.
 * 0111-1111: Reserved
 * Note: These bits get cleared automatically
 */
#define ENET_PPS_CTRL_PPSCTRLCMD0_MASK (0xFU)
#define ENET_PPS_CTRL_PPSCTRLCMD0_SHIFT (0U)
#define ENET_PPS_CTRL_PPSCTRLCMD0_SET(x) (((uint32_t)(x) << ENET_PPS_CTRL_PPSCTRLCMD0_SHIFT) & ENET_PPS_CTRL_PPSCTRLCMD0_MASK)
#define ENET_PPS_CTRL_PPSCTRLCMD0_GET(x) (((uint32_t)(x) & ENET_PPS_CTRL_PPSCTRLCMD0_MASK) >> ENET_PPS_CTRL_PPSCTRLCMD0_SHIFT)

